n5/src/InformationRegisters/Deductions/Deductions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Deductions</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Use</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Deduction</name>
    <type>
      <types>CatalogRef.DeductionsClassifier</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Deductions/Forms/Canceling/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	Record.Use = false;
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	Record.Employee = Parameters.Employee;
	Record.Deduction = Parameters.Deduction;
	
EndProcedure
